clc
clear all
% % x=[1 2 3 4 ];
% % y=[3 2 1 0];
% % z=[89.42 93.52 92.35 92.24];
% % x1=[1 2 3 4 ];
% % y1=[3 2 1 0];
% % z1=[91.42 95.4233 93.35 90.82];
% % plot(x,y,z,'b*-',x1,y1,z1,'ro-')
% % title('混合模型识别率')
% % xlabel('RBM个数')
% % ylabel('DAE个数')
% % zlabel('识别率')
% % legend('DBN','DAE')
% legend('boxoff')

x=[1: 100:1000];
y1=[52.5 43.9 56.9 61.8 42.7 85.0 89.2  88.4 76.2 77.4];
y2=[31.5 23.9 46.9 51.8 52.7 65.0 76.2  78.4 70.2 57.4];
plot(x,y1,'b*-',x,y2,'ro-')
title('隐含层数目对识别率的影响')
xlabel('隐含层数目')
ylabel('识别率')
legend('MNIST','Caltech-101')